keyboardpartner/HX3/FOR_OEM/ATmegaBOOT_xx8.c
		    }
		    /* end of monitor functions */

		}
	    }
	}
	/* end of monitor */
#endif
	else if (++error_count == MAX_ERROR_COUNT) {
	    app_start();
	}
    }
    /* end of forever loop */

}

char gethexnib(void) {
  char a;
  a = getch(); putch(a);
  if(a >= 'a') {
    return (a - 'a' + 0x0a);
  } else if(a >= '0') {
    return(a - '0');
  }
}

char gethex(void) {
  return (gethexnib() << 4) + gethexnib();
}

void puthex(char ch) {
    char ah;

    ah = ch >> 4;
    if(ah >= 0x0a) {
	ah = ah - 0x0a + 'a';
    } else {
	ah += '0';
    }
    ch &= 0x0f;
    if(ch >= 0x0a) {
	ch = ch - 0x0a + 'a';
    } else {
	ch += '0';
    }
    putch(ah);
    putch(ch);
}


void putch(char ch)
{
#ifdef __AVR_ATmega128__
    if(bootuart == 1) {
	while (!(UCSR0A & _BV(UDRE0)));
	UDR0 = ch;
    }
    else if (bootuart == 2) {
	while (!(UCSR1A & _BV(UDRE1)));
	UDR1 = ch;
    }
#elif defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__) || defined(__AVR_ATmega644P__)
    while (!(UCSR0A & _BV(UDRE0)));
    UDR0 = ch;
#else
    /* m8,16,32,169,8515,8535,163 */
    while (!(UCSRA & _BV(UDRE)));
    UDR = ch;
#endif
}


char getch(void)
{
#ifdef __AVR_ATmega128__
    if(bootuart == 1) {
	while(!(UCSR0A & _BV(RXC0)));
	return UDR0;
    }
    else if(bootuart == 2) {
	while(!(UCSR1A & _BV(RXC1)));
	return UDR1;
    }
    return 0;
#elif defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__) || defined(__AVR_ATmega644P__)
    uint32_t count = 0;

    LED_PORT &= ~_BV(LED);

    while(!(UCSR0A & _BV(RXC0))){
    	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/
    	/* HACKME:: here is a good place to count times*/
    	count++;
    	if (count > MAX_TIME_COUNT)
    		app_start();
     }

    LED_PORT |= _BV(LED);          // turn on the LED to indicate receiving data
    return UDR0;
#else
    /* m8,16,32,169,8515,8535,163 */
    uint32_t count = 0;
    while(!(UCSRA & _BV(RXC))){
    	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/
    	/* HACKME:: here is a good place to count times*/
    	count++;
    	if (count > MAX_TIME_COUNT)
    		app_start();
     }
    return UDR;
#endif
}


void getNch(uint8_t count)
{
  while (count--) {
#ifdef __AVR_ATmega128__
	if(bootuart == 1) {
	    while(!(UCSR0A & _BV(RXC0)));
	    UDR0;
	}
	else if(bootuart == 2) {
	    while(!(UCSR1A & _BV(RXC1)));
	    UDR1;
	}
#elif defined(__AVR_ATmega168__)  || defined(__AVR_ATmega328P__) || defined(__AVR_ATmega644P__)
	while(!(UCSR0A & _BV(RXC0)));
	UDR0;
#else
	/* m8,16,32,169,8515,8535,163 */
   	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/
	//while(!(UCSRA & _BV(RXC)));
	//UDR;
	while (count--) {
	  getch(); // need to handle time out
	}
#endif
    }
}


void byte_response(uint8_t val)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(val);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}


void nothing_response(void)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}

void flash_led(uint8_t count)
{
  /* flash onboard LED three times to signal entering of bootloader */
  /* l needs to be volatile or the delay loops below might get
     optimized away if compiling with optimizations (DAM). */
  //volatile uint32_t l;

    if (count == 0) {
      count = 3;
    }

    while (count--) {
	LED_PORT |= _BV(LED);
	//for(l = 0; l < (F_CPU / 1000); ++l);
	_delay_ms(100);
	LED_PORT &= ~_BV(LED);
	//for(l = 0; l < (F_CPU / 1000); ++l);
	_delay_ms(100);
    }
}


/* end of file ATmegaBOOT.c */
